mist-devel/mist-firmware/hw/ATSAMV71/component/component_gmac.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/*                       SAM Software Package License                           */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2015, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */

#ifndef _SAMV71_GMAC_COMPONENT_
#define _SAMV71_GMAC_COMPONENT_

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR Gigabit Ethernet MAC */
/* ============================================================================= */
/** \addtogroup SAMV71_GMAC Gigabit Ethernet MAC */
/*@{*/

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief GmacSa hardware registers */
typedef struct {
	__IO uint32_t GMAC_SAB; /**< \brief (GmacSa Offset: 0x0) Specific Address 1 Bottom [31:0] Register */
	__IO uint32_t GMAC_SAT; /**< \brief (GmacSa Offset: 0x4) Specific Address 1 Top [47:32] Register */
} GmacSa;
/** \brief GmacSt2Compare hardware registers */
typedef struct {
	__IO uint32_t GMAC_ST2CW0; /**< \brief 31:16 - Compare Value. 15:0 - Mask Value. */
	__IO uint32_t GMAC_ST2CW1; /**< \brief 31:9 - Reserved; 8:7 - Offset location in frame; 6:0 Offset value in bytes */
} GmacSt2Cw;
/** \brief Gmac hardware registers */
typedef struct {
	__IO uint32_t GMAC_NCR;        /**< \brief (Gmac Offset: 0x000) Network Control Register */
	__IO uint32_t GMAC_NCFGR;      /**< \brief (Gmac Offset: 0x004) Network Configuration Register */
	__I  uint32_t GMAC_NSR;        /**< \brief (Gmac Offset: 0x008) Network Status Register */
	__IO uint32_t GMAC_UR;         /**< \brief (Gmac Offset: 0x00C) User Register */
	__IO uint32_t GMAC_DCFGR;      /**< \brief (Gmac Offset: 0x010) DMA Configuration Register */
	__IO uint32_t GMAC_TSR;        /**< \brief (Gmac Offset: 0x014) Transmit Status Register */
	__IO uint32_t GMAC_RBQB;       /**< \brief (Gmac Offset: 0x018) Receive Buffer Queue Base Address Register */
	__IO uint32_t GMAC_TBQB;       /**< \brief (Gmac Offset: 0x01C) Transmit Buffer Queue Base Address Register */
	__IO uint32_t GMAC_RSR;        /**< \brief (Gmac Offset: 0x020) Receive Status Register */
	__I  uint32_t GMAC_ISR;        /**< \brief (Gmac Offset: 0x024) Interrupt Status Register */
	__O  uint32_t GMAC_IER;        /**< \brief (Gmac Offset: 0x028) Interrupt Enable Register */
	__O  uint32_t GMAC_IDR;        /**< \brief (Gmac Offset: 0x02C) Interrupt Disable Register */
	__IO uint32_t GMAC_IMR;        /**< \brief (Gmac Offset: 0x030) Interrupt Mask Register */
	__IO uint32_t GMAC_MAN;        /**< \brief (Gmac Offset: 0x034) PHY Maintenance Register */
	__I  uint32_t GMAC_RPQ;        /**< \brief (Gmac Offset: 0x038) Received Pause Quantum Register */
	__IO uint32_t GMAC_TPQ;        /**< \brief (Gmac Offset: 0x03C) Transmit Pause Quantum Register */
	__IO uint32_t GMAC_TPSF;       /**< \brief (Gmac Offset: 0x040) TX Partial Store and Forward Register */
	__IO uint32_t GMAC_RPSF;       /**< \brief (Gmac Offset: 0x044) RX Partial Store and Forward Register */
	__IO uint32_t GMAC_RJFML;      /**< \brief (Gmac Offset: 0x048) RX Jumbo Frame Max Length Register */
	__I  uint32_t Reserved1[13];
	__IO uint32_t GMAC_HRB;        /**< \brief (Gmac Offset: 0x080) Hash Register Bottom [31:0] */
	__IO uint32_t GMAC_HRT;        /**< \brief (Gmac Offset: 0x084) Hash Register Top [63:32] */
	     GmacSa   GMAC_SA[4];      /**< \brief (Gmac Offset: 0x088) 1 .. 4 */
	__IO uint32_t GMAC_TIDM[4];    /**< \brief (Gmac Offset: 0x0A8) Type ID Match 1 Register */
	__IO uint32_t GMAC_WOL;        /**< \brief (Gmac Offset: 0x0B8) Wake on LAN Register */
	__IO uint32_t GMAC_IPGS;       /**< \brief (Gmac Offset: 0x0BC) IPG Stretch Register */
	__IO uint32_t GMAC_SVLAN;      /**< \brief (Gmac Offset: 0x0C0) Stacked VLAN Register */
	__IO uint32_t GMAC_TPFCP;      /**< \brief (Gmac Offset: 0x0C4) Transmit PFC Pause Register */
	__IO uint32_t GMAC_SAMB1;      /**< \brief (Gmac Offset: 0x0C8) Specific Address 1 Mask Bottom Register */
	__IO uint32_t GMAC_SAMT1;      /**< \brief (Gmac Offset: 0x0CC) Specific Address 1 Mask Top Register */
	__I  uint32_t Reserved2[3];
	__IO uint32_t GMAC_NSC;        /**< \brief (Gmac Offset: 0x0DC) 1588 Timer Nanosecond Comparison Register */
	__IO uint32_t GMAC_SCL;        /**< \brief (Gmac Offset: 0x0E0) 1588 Timer Second Comparison Low Register */
	__IO uint32_t GMAC_SCH;        /**< \brief (Gmac Offset: 0x0E4) 1588 Timer Second Comparison High Register */
	__I  uint32_t GMAC_EFTSH;      /**< \brief (Gmac Offset: 0x0E8) PTP Event Frame Transmitted Seconds High Register */
	__I  uint32_t GMAC_EFRSH;      /**< \brief (Gmac Offset: 0x0EC) PTP Event Frame Received Seconds High Register */
	__I  uint32_t GMAC_PEFTSH;     /**< \brief (Gmac Offset: 0x0F0) PTP Peer Event Frame Transmitted Seconds High Register */
	__I  uint32_t GMAC_PEFRSH;     /**< \brief (Gmac Offset: 0x0F4) PTP Peer Event Frame Received Seconds High Register */
	__I  uint32_t Reserved3[1];
	__I  uint32_t GMAC_MID;        /**< \brief (Gmac Offset: 0x0FC) Module ID Register */
	__I  uint32_t GMAC_OTLO;       /**< \brief (Gmac Offset: 0x100) Octets Transmitted Low Register */
	__I  uint32_t GMAC_OTHI;       /**< \brief (Gmac Offset: 0x104) Octets Transmitted High Register */
	__I  uint32_t GMAC_FT;         /**< \brief (Gmac Offset: 0x108) Frames Transmitted Register */
	__I  uint32_t GMAC_BCFT;       /**< \brief (Gmac Offset: 0x10C) Broadcast Frames Transmitted Register */
	__I  uint32_t GMAC_MFT;        /**< \brief (Gmac Offset: 0x110) Multicast Frames Transmitted Register */
	__I  uint32_t GMAC_PFT;        /**< \brief (Gmac Offset: 0x114) Pause Frames Transmitted Register */
	__I  uint32_t GMAC_BFT64;      /**< \brief (Gmac Offset: 0x118) 64 Byte Frames Transmitted Register */
	__I  uint32_t GMAC_TBFT127;    /**< \brief (Gmac Offset: 0x11C) 65 to 127 Byte Frames Transmitted Register */
	__I  uint32_t GMAC_TBFT255;    /**< \brief (Gmac Offset: 0x120) 128 to 255 Byte Frames Transmitted Register */
	__I  uint32_t GMAC_TBFT511;    /**< \brief (Gmac Offset: 0x124) 256 to 511 Byte Frames Transmitted Register */
	__I  uint32_t GMAC_TBFT1023;   /**< \brief (Gmac Offset: 0x128) 512 to 1023 Byte Frames Transmitted Register */
	__I  uint32_t GMAC_TBFT1518;   /**< \brief (Gmac Offset: 0x12C) 1024 to 1518 Byte Frames Transmitted Register */
	__I  uint32_t GMAC_GTBFT1518;  /**< \brief (Gmac Offset: 0x130) Greater Than 1518 Byte Frames Transmitted Register */
	__I  uint32_t GMAC_TUR;        /**< \brief (Gmac Offset: 0x134) Transmit Underruns Register */
	__I  uint32_t GMAC_SCF;        /**< \brief (Gmac Offset: 0x138) Single Collision Frames Register */
	__I  uint32_t GMAC_MCF;        /**< \brief (Gmac Offset: 0x13C) Multiple Collision Frames Register */
	__I  uint32_t GMAC_EC;         /**< \brief (Gmac Offset: 0x140) Excessive Collisions Register */
	__I  uint32_t GMAC_LC;         /**< \brief (Gmac Offset: 0x144) Late Collisions Register */
	__I  uint32_t GMAC_DTF;        /**< \brief (Gmac Offset: 0x148) Deferred Transmission Frames Register */
	__I  uint32_t GMAC_CSE;        /**< \brief (Gmac Offset: 0x14C) Carrier Sense Errors Register */
	__I  uint32_t GMAC_ORLO;       /**< \brief (Gmac Offset: 0x150) Octets Received Low Received Register */
	__I  uint32_t GMAC_ORHI;       /**< \brief (Gmac Offset: 0x154) Octets Received High Received Register */
	__I  uint32_t GMAC_FR;         /**< \brief (Gmac Offset: 0x158) Frames Received Register */
	__I  uint32_t GMAC_BCFR;       /**< \brief (Gmac Offset: 0x15C) Broadcast Frames Received Register */
	__I  uint32_t GMAC_MFR;        /**< \brief (Gmac Offset: 0x160) Multicast Frames Received Register */
	__I  uint32_t GMAC_PFR;        /**< \brief (Gmac Offset: 0x164) Pause Frames Received Register */
	__I  uint32_t GMAC_BFR64;      /**< \brief (Gmac Offset: 0x168) 64 Byte Frames Received Register */
	__I  uint32_t GMAC_TBFR127;    /**< \brief (Gmac Offset: 0x16C) 65 to 127 Byte Frames Received Register */
	__I  uint32_t GMAC_TBFR255;    /**< \brief (Gmac Offset: 0x170) 128 to 255 Byte Frames Received Register */
	__I  uint32_t GMAC_TBFR511;    /**< \brief (Gmac Offset: 0x174) 256 to 511 Byte Frames Received Register */
	__I  uint32_t GMAC_TBFR1023;   /**< \brief (Gmac Offset: 0x178) 512 to 1023 Byte Frames Received Register */
	__I  uint32_t GMAC_TBFR1518;   /**< \brief (Gmac Offset: 0x17C) 1024 to 1518 Byte Frames Received Register */
	__I  uint32_t GMAC_TMXBFR;     /**< \brief (Gmac Offset: 0x180) 1519 to Maximum Byte Frames Received Register */
	__I  uint32_t GMAC_UFR;        /**< \brief (Gmac Offset: 0x184) Undersize Frames Received Register */
	__I  uint32_t GMAC_OFR;        /**< \brief (Gmac Offset: 0x188) Oversize Frames Received Register */
	__I  uint32_t GMAC_JR;         /**< \brief (Gmac Offset: 0x18C) Jabbers Received Register */
	__I  uint32_t GMAC_FCSE;       /**< \brief (Gmac Offset: 0x190) Frame Check Sequence Errors Register */
	__I  uint32_t GMAC_LFFE;       /**< \brief (Gmac Offset: 0x194) Length Field Frame Errors Register */
	__I  uint32_t GMAC_RSE;        /**< \brief (Gmac Offset: 0x198) Receive Symbol Errors Register */
	__I  uint32_t GMAC_AE;         /**< \brief (Gmac Offset: 0x19C) Alignment Errors Register */
	__I  uint32_t GMAC_RRE;        /**< \brief (Gmac Offset: 0x1A0) Receive Resource Errors Register */
	__I  uint32_t GMAC_ROE;        /**< \brief (Gmac Offset: 0x1A4) Receive Overrun Register */
	__I  uint32_t GMAC_IHCE;       /**< \brief (Gmac Offset: 0x1A8) IP Header Checksum Errors Register */
	__I  uint32_t GMAC_TCE;        /**< \brief (Gmac Offset: 0x1AC) TCP Checksum Errors Register */
	__I  uint32_t GMAC_UCE;        /**< \brief (Gmac Offset: 0x1B0) UDP Checksum Errors Register */
	__I  uint32_t Reserved4[2];
	__IO uint32_t GMAC_TISUBN;     /**< \brief (Gmac Offset: 0x1BC) 1588 Timer Increment Sub-nanoseconds Register */
	__IO uint32_t GMAC_TSH;        /**< \brief (Gmac Offset: 0x1C0) 1588 Timer Seconds High Register */
	__I  uint32_t Reserved5[3];
	__IO uint32_t GMAC_TSL;        /**< \brief (Gmac Offset: 0x1D0) 1588 Timer Seconds Low Register */
	__IO uint32_t GMAC_TN;         /**< \brief (Gmac Offset: 0x1D4) 1588 Timer Nanoseconds Register */
	__O  uint32_t GMAC_TA;         /**< \brief (Gmac Offset: 0x1D8) 1588 Timer Adjust Register */
	__IO uint32_t GMAC_TI;         /**< \brief (Gmac Offset: 0x1DC) 1588 Timer Increment Register */
	__I  uint32_t GMAC_EFTSL;      /**< \brief (Gmac Offset: 0x1E0) PTP Event Frame Transmitted Seconds Low Register */
	__I  uint32_t GMAC_EFTN;       /**< \brief (Gmac Offset: 0x1E4) PTP Event Frame Transmitted Nanoseconds Register */
	__I  uint32_t GMAC_EFRSL;      /**< \brief (Gmac Offset: 0x1E8) PTP Event Frame Received Seconds Low Register */
	__I  uint32_t GMAC_EFRN;       /**< \brief (Gmac Offset: 0x1EC) PTP Event Frame Received Nanoseconds Register */
	__I  uint32_t GMAC_PEFTSL;     /**< \brief (Gmac Offset: 0x1F0) PTP Peer Event Frame Transmitted Seconds Low Register */
	__I  uint32_t GMAC_PEFTN;      /**< \brief (Gmac Offset: 0x1F4) PTP Peer Event Frame Transmitted Nanoseconds Register */
	__I  uint32_t GMAC_PEFRSL;     /**< \brief (Gmac Offset: 0x1F8) PTP Peer Event Frame Received Seconds Low Register */
	__I  uint32_t GMAC_PEFRN;      /**< \brief (Gmac Offset: 0x1FC) PTP Peer Event Frame Received Nanoseconds Register */
	__I  uint32_t Reserved6[128];
	__I  uint32_t GMAC_ISRPQ[5];   /**< \brief (Gmac Offset: 0x400) Interrupt Status Register Priority Queue (index = 1) */
	__I  uint32_t Reserved7[11];
	__IO uint32_t GMAC_TBQBAPQ[5]; /**< \brief (Gmac Offset: 0x440) Transmit Buffer Queue Base Address Register Priority Queue (index = 1) */
	__I  uint32_t Reserved8[11];
	__IO uint32_t GMAC_RBQBAPQ[5]; /**< \brief (Gmac Offset: 0x480) Receive Buffer Queue Base Address Register Priority Queue (index = 1) */
	__I  uint32_t Reserved9[3];
	__IO uint32_t GMAC_RBSRPQ[5];  /**< \brief (Gmac Offset: 0x4A0) Receive Buffer Size Register Priority Queue (index = 1) */
	__I  uint32_t Reserved10[2];
	__IO uint32_t GMAC_CBSCR;      /**< \brief (Gmac Offset: 0x4BC) Credit-Based Shaping Control Register */
	__IO uint32_t GMAC_CBSISQA;    /**< \brief (Gmac Offset: 0x4C0) Credit-Based Shaping IdleSlope Register for Queue A */
	__IO uint32_t GMAC_CBSISQB;    /**< \brief (Gmac Offset: 0x4C4) Credit-Based Shaping IdleSlope Register for Queue B */
	__I  uint32_t Reserved11[14];
	__IO uint32_t GMAC_ST1RPQ[4];  /**< \brief (Gmac Offset: 0x500) Screening Type 1 Register Priority Queue (index = 0..3) */
	__I  uint32_t Reserved12[12];
	__IO uint32_t GMAC_ST2RPQ[8];  /**< \brief (Gmac Offset: 0x540) Screening Type 2 Register Priority Queue (index = 0..7) */
	__I  uint32_t Reserved13[12];
	__I  uint32_t Reserved14[28];
	__O  uint32_t GMAC_IERPQ[5];   /**< \brief (Gmac Offset: 0x600) Interrupt Enable Register Priority Queue (index = 1..5) */
	__I  uint32_t Reserved15[3];
	__O  uint32_t GMAC_IDRPQ[5];   /**< \brief (Gmac Offset: 0x620) Interrupt Disable Register Priority Queue (index = 1..5) */
	__I  uint32_t Reserved16[3];
	__IO uint32_t GMAC_IMRPQ[5];   /**< \brief (Gmac Offset: 0x640) Interrupt Mask Register Priority Queue (index = 1..5) */
	__I  uint32_t Reserved17[35];
	__IO uint32_t GMAC_ST2ER[4];   /**< \brief (Gmac Offset: 0x6E0) Screening Type 2 Ethertype Register (index = 0..3) */
	__I  uint32_t Reserved18[4];
	     GmacSt2Cw GMAC_ST2CW[24]; /**< \brief (Gmac Offset: 0x700) Screener Type 2 Compare Registers */
} Gmac;
