mist-devel/mist-firmware/hw/ATSAMV71/component/component_gmac.h
#define GMAC_ST2RPQ_COMPC_Pos 25
#define GMAC_ST2RPQ_COMPC_Msk (0x1fu << GMAC_ST2RPQ_COMPC_Pos) /**< \brief (GMAC_ST2RPQ[8]) Index of Screening Type 2 Compare Word 0/Word 1 register x */
#define GMAC_ST2RPQ_COMPC(value) ((GMAC_ST2RPQ_COMPC_Msk & ((value) << GMAC_ST2RPQ_COMPC_Pos)))
#define GMAC_ST2RPQ_COMPCE (0x1u << 30) /**< \brief (GMAC_ST2RPQ[8]) Compare C Enable */
/* -------- GMAC_IERPQ[5] : (GMAC Offset: 0x600) Interrupt Enable Register Priority Queue -------- */
#define GMAC_IERPQ_RCOMP (0x1u << 1) /**< \brief (GMAC_IERPQ[5]) Receive Complete */
#define GMAC_IERPQ_RXUBR (0x1u << 2) /**< \brief (GMAC_IERPQ[5]) RX Used Bit Read */
#define GMAC_IERPQ_RLEX (0x1u << 5) /**< \brief (GMAC_IERPQ[5]) Retry Limit Exceeded or Late Collision */
#define GMAC_IERPQ_TFC (0x1u << 6) /**< \brief (GMAC_IERPQ[5]) Transmit Frame Corruption Due to AHB Error */
#define GMAC_IERPQ_TCOMP (0x1u << 7) /**< \brief (GMAC_IERPQ[5]) Transmit Complete */
#define GMAC_IERPQ_ROVR (0x1u << 10) /**< \brief (GMAC_IERPQ[5]) Receive Overrun */
#define GMAC_IERPQ_HRESP (0x1u << 11) /**< \brief (GMAC_IERPQ[5]) HRESP Not OK */
/* -------- GMAC_IDRPQ[5] : (GMAC Offset: 0x620) Interrupt Disable Register Priority Queue -------- */
#define GMAC_IDRPQ_RCOMP (0x1u << 1) /**< \brief (GMAC_IDRPQ[5]) Receive Complete */
#define GMAC_IDRPQ_RXUBR (0x1u << 2) /**< \brief (GMAC_IDRPQ[5]) RX Used Bit Read */
#define GMAC_IDRPQ_RLEX (0x1u << 5) /**< \brief (GMAC_IDRPQ[5]) Retry Limit Exceeded or Late Collision */
#define GMAC_IDRPQ_TFC (0x1u << 6) /**< \brief (GMAC_IDRPQ[5]) Transmit Frame Corruption Due to AHB Error */
#define GMAC_IDRPQ_TCOMP (0x1u << 7) /**< \brief (GMAC_IDRPQ[5]) Transmit Complete */
#define GMAC_IDRPQ_ROVR (0x1u << 10) /**< \brief (GMAC_IDRPQ[5]) Receive Overrun */
#define GMAC_IDRPQ_HRESP (0x1u << 11) /**< \brief (GMAC_IDRPQ[5]) HRESP Not OK */
/* -------- GMAC_IMRPQ[5] : (GMAC Offset: 0x640) Interrupt Mask Register Priority Queue -------- */
#define GMAC_IMRPQ_RCOMP (0x1u << 1) /**< \brief (GMAC_IMRPQ[5]) Receive Complete */
#define GMAC_IMRPQ_RXUBR (0x1u << 2) /**< \brief (GMAC_IMRPQ[5]) RX Used Bit Read */
#define GMAC_IMRPQ_RLEX (0x1u << 5) /**< \brief (GMAC_IMRPQ[5]) Retry Limit Exceeded or Late Collision */
#define GMAC_IMRPQ_AHB (0x1u << 6) /**< \brief (GMAC_IMRPQ[5]) AHB Error */
#define GMAC_IMRPQ_TCOMP (0x1u << 7) /**< \brief (GMAC_IMRPQ[5]) Transmit Complete */
#define GMAC_IMRPQ_ROVR (0x1u << 10) /**< \brief (GMAC_IMRPQ[5]) Receive Overrun */
#define GMAC_IMRPQ_HRESP (0x1u << 11) /**< \brief (GMAC_IMRPQ[5]) HRESP Not OK */
/* -------- GMAC_ST2ER[4] : (GMAC Offset: 0x6E0) Screening Type 2 Ethertype Register  (index = 0) -------- */
#define GMAC_ST2ER_COMPVAL_Pos 0
#define GMAC_ST2ER_COMPVAL_Msk (0xffffu << GMAC_ST2ER_COMPVAL_Pos) /**< \brief (GMAC_ST2ER[4]) Ethertype Compare Value */
#define GMAC_ST2ER_COMPVAL(value) ((GMAC_ST2ER_COMPVAL_Msk & ((value) << GMAC_ST2ER_COMPVAL_Pos)))
/* -------- GMAC_ST2CW0 : (GMAC Offset: N/A) Screening Type 2 Compare Word 0 Register  (index = 0) -------- */
#define GMAC_ST2CW0_MASKVAL_Pos 0
#define GMAC_ST2CW0_MASKVAL_Msk (0xffffu << GMAC_ST2CW0_MASKVAL_Pos) /**< \brief (GMAC_ST2CW0) Mask Value */
#define GMAC_ST2CW0_MASKVAL(value) ((GMAC_ST2CW0_MASKVAL_Msk & ((value) << GMAC_ST2CW0_MASKVAL_Pos)))
#define GMAC_ST2CW0_COMPVAL_Pos 16
#define GMAC_ST2CW0_COMPVAL_Msk (0xffffu << GMAC_ST2CW0_COMPVAL_Pos) /**< \brief (GMAC_ST2CW0) Compare Value */
#define GMAC_ST2CW0_COMPVAL(value) ((GMAC_ST2CW0_COMPVAL_Msk & ((value) << GMAC_ST2CW0_COMPVAL_Pos)))
/* -------- GMAC_ST2CW1 : (GMAC Offset: N/A) Screening Type 2 Compare Word 1 Register  (index = 0) -------- */
#define GMAC_ST2CW1_OFFSVAL_Pos 0
#define GMAC_ST2CW1_OFFSVAL_Msk (0x7fu << GMAC_ST2CW1_OFFSVAL_Pos) /**< \brief (GMAC_ST2CW1) Offset Value in Bytes */
#define GMAC_ST2CW1_OFFSVAL(value) ((GMAC_ST2CW1_OFFSVAL_Msk & ((value) << GMAC_ST2CW1_OFFSVAL_Pos)))
#define GMAC_ST2CW1_OFFSSTRT_Pos 7
#define GMAC_ST2CW1_OFFSSTRT_Msk (0x3u << GMAC_ST2CW1_OFFSSTRT_Pos) /**< \brief (GMAC_ST2CW1) Ethernet Frame Offset Start */
#define GMAC_ST2CW1_OFFSSTRT(value) ((GMAC_ST2CW1_OFFSSTRT_Msk & ((value) << GMAC_ST2CW1_OFFSSTRT_Pos)))
#define   GMAC_ST2CW1_OFFSSTRT_FRAMESTART (0x0u << 7) /**< \brief (GMAC_ST2CW1) Offset from the start of the frame */
#define   GMAC_ST2CW1_OFFSSTRT_ETHERTYPE (0x1u << 7) /**< \brief (GMAC_ST2CW1) Offset from the byte after the EtherType field */
#define   GMAC_ST2CW1_OFFSSTRT_IP (0x2u << 7) /**< \brief (GMAC_ST2CW1) Offset from the byte after the IP header field */
#define   GMAC_ST2CW1_OFFSSTRT_TCP_UDP (0x3u << 7) /**< \brief (GMAC_ST2CW1) Offset from the byte after the TCP/UDP header field */

/*@}*/

#endif /* _SAMV71_GMAC_COMPONENT_ */
